In [1]:
import pandas as pd

In [44]:
d1 = {'A': [1, 1, 1, 1], 'B': [2, 2, 2, 2], 'C': [3, 3, 4, 4], 'D': [4, 4, 5, 5], 'E': [5, 5, 6, 6], 'F': [6, 6, 7, 7]}

In [45]:
df = pd.DataFrame(d1)
df

   A  B  C  D  E  F
0  1  2  3  4  5  6
1  1  2  3  4  5  6
2  1  2  4  5  6  7
3  1  2  4  5  6  7

In [29]:
df.iloc[:, 2:3]

   C
0  3
1  3
2  4
3  4

In [26]:
df.drop_duplicates(['C'])

   A  B  C  D  E  F
0  1  2  3  4  5  6
2  1  2  4  5  6  7

In [33]:
df2 = pd.DataFrame(d1)
df2

   A  B  C  D  E  F
0  1  2  3  4  5  6
1  1  2  3  4  5  6
2  1  2  4  5  6  7
3  1  2  4  5  6  7

In [36]:
df.drop_duplicates(keep='last')

   A  B  C  D  E  F
1  1  2  3  4  5  6
3  1  2  4  5  6  7

In [37]:
df.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [38]:
for i in df:
    print(i)

A
B
C
D
E
F

In [39]:
for x in df.columns:
    print(x)

A
B
C
D
E
F

In [49]:
for col, value in df.iteritems():
    print(col, "\n")
    print(value)

A

0    1
1    1
2    1
3    1
Name: A, dtype: int64
B

0    2
1    2
2    2
3    2
Name: B, dtype: int64
C

0    3
1    3
2    4
3    4
Name: C, dtype: int64
D

0    4
1    4
2    5
3    5
Name: D, dtype: int64
E

0    5
1    5
2    6
3    6
Name: E, dtype: int64
F

0    6
1    6
2    7
3    7
Name: F, dtype: int64

In [50]:
df2

   A  B  C  D  E  F
0  1  2  3  4  5  6
1  1  2  3  4  5  6
2  1  2  4  5  6  7
3  1  2  4  5  6  7

In [52]:
for x, y in df2.iterrows():
    print(x, "\n")
    print(y, "\n")

0

A    1
B    2
C    3
D    4
E    5
F    6
Name: 0, dtype: int64

1

A    1
B    2
C    3
D    4
E    5
F    6
Name: 1, dtype: int64

2

A    1
B    2
C    4
D    5
E    6
F    7
Name: 2, dtype: int64

3

A    1
B    2
C    4
D    5
E    6
F    7
Name: 3, dtype: int64

In [61]:
l1= ['A', 'B', 'C' ,'D']

In [68]:
for index, x in enumerate(l1):
    print(index, ": ", x)

0 :  A
1 :  B
2 :  C
3 :  D

In [67]:
for index, x in enumerate(l1, start=10):
    print(index, ": ", x)

10 :  A
11 :  B
12 :  C
13 :  D